IdeaRS.Connections
PlateSizeMethodTypes Enumeration
Compatible with IDEA StatiCa 0.0
 Represents types of methods of possible definitions of a plate size
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
[FlagsAttribute]
public enum PlateSizeMethodTypes
Members
Member name | Value | Description
Default | 0 |  Default
IsSymmetry | 1 |  Is symmetrical
ToProfile | 2 |  Sizes of a plate are given by connected profile.
Rectangle | 4 |  Sizes of a plate are given by sizes of a rectangle.
Circle | 8 |  Size of a plate is given by radius.
ToProfileSymmetrical | 3 |  Sizes of a plate are given by connected profile. Symmetrical
RectangleSymmetrical | 5 |  Sizes of a plate are given by sizes of a rectangle. Symmetrical.
TopOfSteel | 6 |  Size of plate is measured from the top of connected profile.
See Also
Reference
IdeaRS.Connections.Data Namespace